src/test/jmeter/order-load-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="CommerceCore Order Load Test" enabled="true">
      <stringProp name="TestPlan.comments">POST /api/orders load test. See README.md Performance Test section for run instructions and results.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">${__P(base_url,http://localhost:8080)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="ADMIN_EMAIL" elementType="Argument">
            <stringProp name="Argument.name">ADMIN_EMAIL</stringProp>
            <stringProp name="Argument.value">${__P(admin_email,admin@commercecore.local)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="ADMIN_PASSWORD" elementType="Argument">
            <stringProp name="Argument.name">ADMIN_PASSWORD</stringProp>
            <stringProp name="Argument.value">${__P(admin_password,admin-bootstrap-pass)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PRODUCT_COUNT" elementType="Argument">
            <stringProp name="Argument.name">PRODUCT_COUNT</stringProp>
            <stringProp name="Argument.value">${__P(product_count,20)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="STOCK_PER_PRODUCT" elementType="Argument">
            <stringProp name="Argument.name">STOCK_PER_PRODUCT</stringProp>
            <stringProp name="Argument.value">${__P(stock_per_product,1000000)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <SetupThreadGroup guiclass="TestBeanGUI" testclass="SetupThreadGroup" testname="Setup: seed admin + catalog" enabled="true">
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">stoptest</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
      </SetupThreadGroup>
      <hashTree>

        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Seed: login admin, create products, set stock" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script"><![CDATA[
import groovy.json.JsonSlurper
import groovy.json.JsonOutput
import java.net.http.HttpClient
import java.net.http.HttpRequest
import java.net.http.HttpResponse

def baseUrl = vars.get('BASE_URL')
def adminEmail = vars.get('ADMIN_EMAIL')
def adminPassword = vars.get('ADMIN_PASSWORD')
def productCount = vars.get('PRODUCT_COUNT') as int
def stockPerProduct = vars.get('STOCK_PER_PRODUCT') as int

def client = HttpClient.newHttpClient()
def slurper = new JsonSlurper()

def post = { String path, String bearer, Object bodyObj ->
    def json = JsonOutput.toJson(bodyObj)
    def builder = HttpRequest.newBuilder()
        .uri(URI.create(baseUrl + path))
        .header('Content-Type', 'application/json')
        .POST(HttpRequest.BodyPublishers.ofString(json))
    if (bearer) {
        builder.header('Authorization', 'Bearer ' + bearer)
    }
    HttpResponse<String> resp = client.send(builder.build(), HttpResponse.BodyHandlers.ofString())
    return resp
}

// Log in as the pre-provisioned admin (see README: ADMIN_EMAIL/ADMIN_PASSWORD bootstrap).
def loginResp = post('/api/auth/login', null, [email: adminEmail, password: adminPassword])
if (loginResp.statusCode() != 200) {
    throw new IllegalStateException('Admin login failed (' + loginResp.statusCode() + '): ' + loginResp.body() +
        ' -- start the app with ADMIN_EMAIL/ADMIN_PASSWORD matching the JMeter admin_email/admin_password properties.')
}
def adminToken = slurper.parseText(loginResp.body()).accessToken

def productIds = []
def runId = System.currentTimeMillis()
for (int i = 0; i < productCount; i++) {
    def sku = 'LOADTEST-' + runId + '-' + i
    def createResp = post('/api/products', adminToken, [sku: sku, name: 'Load test product ' + i, price: 9.99])
    if (createResp.statusCode() != 201) {
        throw new IllegalStateException('Product create failed (' + createResp.statusCode() + '): ' + createResp.body())
    }
    def productId = slurper.parseText(createResp.body()).id

    def stockResp = post('/api/inventory/' + productId + '/stock', adminToken, [quantity: stockPerProduct])
    if (stockResp.statusCode() != 200) {
        throw new IllegalStateException('Stock set failed (' + stockResp.statusCode() + '): ' + stockResp.body())
    }
    productIds << productId
}

// Register the single customer every load-test thread will place orders as.
def customerEmail = 'loadtest-' + runId + '@commercecore.local'
def registerResp = post('/api/auth/register', null,
    [email: customerEmail, password: 'secret123', firstName: 'Load', lastName: 'Test'])
if (registerResp.statusCode() != 201) {
    throw new IllegalStateException('Customer register failed (' + registerResp.statusCode() + '): ' + registerResp.body())
}
def customerToken = slurper.parseText(registerResp.body()).accessToken

props.put('loadtest.customerToken', customerToken)
props.put('loadtest.productIds', productIds.join(','))

log.info('Seeded ' + productIds.size() + ' products with stock=' + stockPerProduct + ' each.')

SampleResult.setResponseData(('Seeded ' + productIds.size() + ' products, customer=' + customerEmail).getBytes('UTF-8'))
SampleResult.setResponseCode('200')
SampleResult.setSuccessful(true)
]]></stringProp>
        </JSR223Sampler>
        <hashTree/>

      </hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Order placement load" enabled="true">
        <stringProp name="ThreadGroup.num_threads">${__P(users,100)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampup,10)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(loops,100)}</stringProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>

        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Pick a random product + shared token" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script"><![CDATA[
def ids = props.get('loadtest.productIds').split(',')
def productId = ids[new Random().nextInt(ids.length)]
vars.put('product_id', productId)
vars.put('customer_token', props.get('loadtest.customerToken'))
vars.put('order_body', '{"items":[{"productId":' + productId + ',"quantity":1}]}')
]]></stringProp>
        </JSR223PreProcessor>
        <hashTree/>

        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Auth + Content-Type headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${customer_token}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/orders" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${order_body}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${__P(host,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(app_port,8080)}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/orders</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">15000</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Expect 201 Created" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">201</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

      </hashTree>

      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>

      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>